{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Part of my research examines Black identity formation in Greece. I focus on how Afro descendants in Greece today, show resistance to the dominant narrative of belonging and express their dual heritage through artistic mediums that illuminate their presence in the country and rich contribution to the art scene. I use my expertise to analyse the audiovisual material selected for the purposes of this project and aspire that viewers will gain more knowledge about the presence of the Black Diaspora in Greece. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Digital Diaspora Studies is an emergent interdisciplinary field that explores the complex interplay between technology, migration, communication, arts, and identity within diasporic communities. While communities in the diaspora are in the process of forming and reshaping their identities and creating new narratives of belonging, they are also experimenting with the digital landscape, engaging in practices that challenge the dynamics of belonging (Heyd 2016). The use of multi-media is also used to contribute to the circulation of knowledges that have been ignored in mainstream spaces and to raise awareness and give visibility."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Joining the collective Døcumatism as a key researcher on the collective community project "
        },
        {
          "text": "‘’the AfroGreeks’’",
          "link": "https://documatism.com/project/the-afrogreeks/"
        },
        {
          "text": ", I realised that my understanding of the African diaspora in Greece was limited to recent events. I needed to explore its rich history in the Mediterranean and understand that right now, the new generation of descendants from African countries are discovering their history and redefining their identity. The community’s numerous differences arise from a myriad of interconnected factors, including historically discriminatory policies and institutional structures that affect economic resources and accessibility."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Through my research, I began to discover the timeless presence of the African diaspora in the Mediterranean, through my engagement as a member of the artistic initiative called the AfroGreeks by the collective Døcumatism. The collective is based in Kypseli and was founded by filmmaker and artist Menelaos Karamaghiolis. It uses art and films featuring real-life heroes in order to challenge stereotypes, explore solutions to societal challenges, and empower marginalised groups. Kypseli is one of Athens’s most culturally diverse neighbourhoods and has a large African population. Among the collective’s most impactful initiatives is the AfroGreeks, an ongoing collective community project that includes video installations, interviews, concerts, workshops, screenings, and an archive-laboratory which keeps expanding. This project connects and collaborates with members of the African diaspora in Greece, creating meeting opportunities for artists within the community to meet and work together and simultaneously through the events created, an extensive audiovisual archive is being built. This archive documents the history of the African diaspora since the 17th century as part of the national narrative and Greek history. The aspiration is that this archive, which includes over two hundred interviews (so far) and audiovisual and archival material, will become a resource for the African communities in Greece, offering visibility to their critical issues and making it freely accessible to anyone interested in learning about the history of the African diaspora in Greece. Τhe ultimate goal is for anyone willing to expand the archive by offering materials collected, or sharing research on specific topics already worked on would be able to do so. The oral histories in the AfroGreeks, co-created with the project’s members, form a complex, unpredictable story that invites public engagement and sheds light on social issues. These documented stories reveal the ongoing presence of racism and how identities are shaped by the concept of homeland. The protagonists of these stories organise public artistic actions, sparking dialogues and interactions between Afro-Greeks, other artists, and the broader society. These public and spontaneous actions are documented, creating valuable visual and material practices that contribute to the discourse on the African diaspora’s presence in Greece."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Using the AfroGreeks as a case study, I elaborate on how the Black community in Greece use creative methods to introduce social issues that are relevant to the broader audience. The project continues to evolve, traveling across Europe through exhibitions, public programs, collaborations, discussions, publications, and live events.  "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "An important milestone of the project has been the celebration of Black History Month (BHM) in 2021. A public action born from my personal aspiration to celebrate Black History Month in Greece in May – the month when the citizenship law for 2nd generation was set for public consultation before being passed in the parliament in 2015- , brought to life through the creation of the first multimedia radio show. Its preparation happened in collaboration with the Anasa Cultural Center of African Arts and the execution was broadcasted live, allowing the audience to witness the creative process in real time. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "In 2024 BHM was celebrated again in the form of a big concert co-created by the project the AfroGreeks and Afro-Greek artists, with the creation of a musical performance dedicated to Afro-American writer, essayist, playwright, and activist James Baldwin, on the occasion of the 101st anniversary of his birth. The concert was a musical dialogue highlighting how artistic Black expression truly transcends borders. In James Baldwin work, it is evident that music reveals a lot about history in our times and Black American music was used at the event as a bridge to acknowledge our separate but collective histories."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "I will be annotating three videos. The recorded clip of the BHM event in 2024 as well as a trailer extracted from the first short movie created for the project the AfroGreeks. Lastly, I will also be annotating a trailer of the events that took place in 2021 on the International Day of the Elimination of Racial Discrimination, which was also World Poetry Day. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Works Cited"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Heyd, T. (2016). “Narratives of Belonging in the Digital Diaspora: Corpus Approaches to a Cultural Concept.” Open Linguistics 2:1, 287-299."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    }
  ],
  "title": "Introduction ",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "introduction",
  "created_at": "2025-11-24T07:00:32.735Z",
  "created_by": "Grace-137",
  "updated_at": "2025-11-24T07:01:08.391Z",
  "updated_by": "Grace-137"
}