{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Afro-Greek refers to a sociocultural identity which encapsulates various Afro-descendants in Greece, including and not limited to Black Greeks, Greeks of African descent, non-Caucasian Greeks, members of the Black Diaspora, Second Generation Africans etc. The term is used primarily by Black Greeks or second-generation migrants of African descent to give visibility to their implicitly excluded from Greek society communities, and to address the lived realities and struggles of Afro-descendants in the country."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The term Afro-Greek can be traced back to 2011, in the song The Coin, by the Afro-Greek artist Mc Yinka, while the visual representation of the term gained prominence with the appearance of Afro-Greek musician and actor Jerome Kaluta – also known as AfroGreco – wearing a traditional Greek fustanella in the play Aristophanes Now in 2011. In 2017, the Afro-Greek artist Negros Tou Moria performed dressed as an Evzone, further solidifying the visual representation of the term and in 2019, during a public discussion in the neighbourhood of Kypseli (one of Athens’s most culturally diverse neighbourhoods which used to accommodate  the largest African population) Afro - Greek was used as a title of the collective community project the Afro-Greeks, due to which, the term was widely spread through social media within the community. The term sparks a discourse about visibility and representation of members of the African diaspora in Greece. After 2019 Afro-Greek is used widely as a self-identification and stimulates debates, as some Afro-descendants argue it serves as an epithet to acknowledge their dual heritage, while others chose to use the term tentatively while exploring what it means to them. There is also a number of people who remain indifferent about the term’s existence."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The term opens a field of discussion regarding the use of hyphenation to define someone’s national identity or ethnic background and adds complexity to the existing debates on assimilation or integration, taking into account the violent histories of displacement, exclusion and othering of people of colour in Greek history (e.g enslaved Africans brought to Greece through the Mediterranean slave trade, during the Ottoman rule) by reintroducing a different context for the use of hyphenation due to migratory movements, citizenship, solidarity, collectiveness, reclamation and creation of a common ground as a resistance to combat invisibility and marginalization (e.g Afro-European). "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "From 2020 onwards there has been a subtle shift in the vocabulary used in media to address people of African descent in Greece, as Black or African descent was often replaced by Afro-Greek. Black artists, athletes, and public figures used the term with pride as a statement that they are both Greek and Afro – African-, maintaining ties with the African continent. Evident in their work (music, public facing activities, performances) they raised awareness about racism and xenophobia but also expressed the beauty of being from two places at the same time, redefining what African heritage in modern Greece means. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Afro-Greek encapsulates, being part of a broader Afro-European/Afropean geography of solidarity and resistance which centers the needs of the local black communities, who are reimagining their identity and creating space for visibility through storytelling. Scholars argue that storytelling practices are core to decolonial geography (Vasudevan, etal 2023). This highlights that Afro-Greek is used to reclaim the right to form a different narrative of belonging. "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "I believe that the emergence of the term Afro - Greek is rooted in the resistance against being denied ‘’Greekness’’ due to the phenotype of skin colour used as a signifier of non-Greekness, as well as the implementation of racist regimes to control access to citizenship and legal rights of belonging.  "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The term Afro-Greek marks the existence of a movement as a spatial intervention. It is a radical act of reclamation of ancestry -Blackness and Greekness- re-inscribing new spatial imaginaries into Greek urban and cultural landscapes, and it is used expansively."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "It can stand as a marker, leading a movement of visibility highlighting that there should not be a dominant narrative of what Greekness should look like. Afro - Greek is critically used as the title of the project because, it opens a discourse. It may not be a perfect term, or one that may last, but it serves as a passage highlighting this movement of Afro-Greek visibility and representation which is necessary now."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Works Cited",
          "underline": true
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "underline": true,
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Vasudevan, Pavithra, Margaret Marietta Ramírez, Yolanda González Mendoza, and Michelle Daigle. “Storytelling Earth and Body.” Annals of the American Association of Geographers 113, no. 7 (2023): 1728–44. https://doi.org/10.1080/24694452.2022.2139658."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    }
  ],
  "title": "But what is Afro-Greek?",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "but-what-is-afro-greek",
  "created_at": "2025-11-24T07:07:51.173Z",
  "created_by": "Grace-137",
  "updated_at": "2025-11-24T07:07:51.173Z",
  "updated_by": "Grace-137"
}